**Importing PANDAS here**

In [1]:
import pandas as pd

**Uploading the CSV file Pth from google drive**

In [2]:
data=pd.read_csv("/content/drive/MyDrive/Colab Notebooks/housing_dataset.csv")

***FINDING HEAD OF THE DATA***

In [3]:
data.head()

   longitude  latitude  ...  ocean_proximity  median_house_value
0    -122.23     37.88  ...         NEAR BAY              452600
1    -122.22     37.86  ...         NEAR BAY              358500
2    -122.24     37.85  ...         NEAR BAY              352100
3    -122.25     37.85  ...         NEAR BAY              341300
4    -122.25     37.85  ...         NEAR BAY              342200

[5 rows x 10 columns]

**APPLYING FUNCTIONS ON THE DATA SET**
1. **SUM FUNCTION**

In [21]:
data["population"].sum()

29421840

2. **MIN FUNCTION TO FIND MINIMUM**

In [22]:
data["population"].min()

3

3. **MAX FUNCTION TO FIND MAXIMUM**

In [23]:
data["population"].max()

35682

4. **DESCRIBE FUNCTION  **

In [24]:
data["population"].describe()

count    20640.000000
mean      1425.476744
std       1132.462122
min          3.000000
25%        787.000000
50%       1166.000000
75%       1725.000000
max      35682.000000
Name: population, dtype: float64

**APPLYING DESCRIBE FUNCTION OVER THE DATA**

In [25]:
data.describe()

          longitude      latitude  ...  median_house_value     New Index
count  20640.000000  20640.000000  ...        20640.000000  20640.000000
mean    -119.569704     35.631861  ...       206855.816909  10319.500000
std        2.003532      2.135952  ...       115395.615874   5958.399114
min     -124.350000     32.540000  ...        14999.000000      0.000000
25%     -121.800000     33.930000  ...       119600.000000   5159.750000
50%     -118.490000     34.260000  ...       179700.000000  10319.500000
75%     -118.010000     37.710000  ...       264725.000000  15479.250000
max     -114.310000     41.950000  ...       500001.000000  20639.000000

[8 rows x 10 columns]

In [26]:
data.describe(include="all")

           longitude      latitude  ...  median_house_value     New Index
count   20640.000000  20640.000000  ...        20640.000000  20640.000000
unique           NaN           NaN  ...                 NaN           NaN
top              NaN           NaN  ...                 NaN           NaN
freq             NaN           NaN  ...                 NaN           NaN
mean     -119.569704     35.631861  ...       206855.816909  10319.500000
std         2.003532      2.135952  ...       115395.615874   5958.399114
min      -124.350000     32.540000  ...        14999.000000      0.000000
25%      -121.800000     33.930000  ...       119600.000000   5159.750000
50%      -118.490000     34.260000  ...       179700.000000  10319.500000
75%      -118.010000     37.710000  ...       264725.000000  15479.250000
max      -114.310000     41.950000  ...       500001.000000  20639.000000

[11 rows x 11 columns]

**USE OF TAIL FUNCTION OVER DATA SET**

In [27]:
data.tail()

       longitude  latitude  ...  median_house_value  New Index
20635    -121.09     39.48  ...               78100      20635
20636    -121.21     39.49  ...               77100      20636
20637    -121.22     39.43  ...               92300      20637
20638    -121.32     39.43  ...               84700      20638
20639    -121.24     39.37  ...               89400      20639

[5 rows x 11 columns]

***Finding all columns and data-type***

In [28]:
data.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'ocean_proximity', 'median_house_value', 'New Index'],
      dtype='object')

**Check for UNIQUE VALUE**

In [29]:
data["housing_median_age"].unique()

array([41, 21, 52, 42, 50, 40, 49, 48, 51, 43,  2, 46, 26, 20, 17, 36, 19,
       23, 38, 35, 10, 16, 27, 39, 31, 29, 22, 37, 28, 34, 32, 47, 44, 30,
       18, 45, 33, 24, 15, 14, 13, 25,  5, 12,  6,  8,  9,  7,  3,  4, 11,
        1])

**Check for NON UNIQUE VALUE**

In [30]:
data["housing_median_age"].nunique()

52

**USE OF SHAPE TO FIND TOTAL ROWS & COLOUMNS OF THE DATA SET**

In [31]:
data.shape

(20640, 11)

**INDEX INITIALISATION FOR ADDING EXTRA INDEX**

In [32]:
x=[i for i in range(20640)]

In [33]:
data["New Index"]=x

**RE-CHECK COLOUMNS ITEM AFTER ADDING NEW INDEX ELEMENT**

In [34]:
data.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'ocean_proximity', 'median_house_value', 'New Index'],
      dtype='object')

**RE-CHECK SHAPE TO FIND TOTAL UPDATED ROWS & COLOUMNS OF THE DATA SET**

In [35]:
data.shape

(20640, 11)

**BY USING HEAD FUNCTION CHECK THE NEW INDEX INITIALISATION**

In [36]:
data.head()

   longitude  latitude  ...  median_house_value  New Index
0    -122.23     37.88  ...              452600          0
1    -122.22     37.86  ...              358500          1
2    -122.24     37.85  ...              352100          2
3    -122.25     37.85  ...              341300          3
4    -122.25     37.85  ...              342200          4

[5 rows x 11 columns]